In [1]:
import pandas as pd
from sqlalchemy import create_engine
from config import user, password

In [2]:
players_file= "Resources/players.csv"

In [3]:
salaries_file = "Resources/salaries.csv"

In [4]:
mvp_file = "Resources/mvp_finals.csv"

In [5]:
mvp_df=pd.read_csv(mvp_file)
mvp_df.head()
mvp_col=['Year','MVP_Name', 'MVP_status']
new_mvp_df = mvp_df[mvp_col].copy()

In [6]:
new_mvp_df=new_mvp_df.rename(columns={'Year':'year','MVP_Name':'name','MVP_status':'finals_status'})
new_mvp_df.head()

   year name finals_status
0  1950  NaN           NaN
1  1951  NaN           NaN
2  1952  NaN           NaN
3  1953  NaN           NaN
4  1954  NaN           NaN

In [7]:
players_df = pd.read_csv(players_file)
players_df.head()
players_col= ['player_id', 'name']
new_players_df= players_df[players_col].copy()
new_players_df.head()

   player_id                 name
0  abdelal01       Alaa Abdelnaby
1  abdulza01      Zaid Abdul-Aziz
2  abdulka01  Kareem Abdul-Jabbar
3  abdulma02   Mahmoud Abdul-Rauf
4  abdulta01    Tariq Abdul-Wahad

In [8]:
salaries_df=pd.read_csv(salaries_file)
salaries_df.head()
salaries_col=['player_id', 'season_end', 'salary']
new_salaries_df = salaries_df[salaries_col].copy()

In [9]:
new_salaries_df=new_salaries_df.rename(columns={'season_end':'year'})
new_salaries_df.head()

   player_id  year  salary
0  abdelal01  1991  395000
1  abdelal01  1992  494000
2  abdelal01  1993  500000
3  abdelal01  1994  805000
4  abdelal01  1995  650000

In [10]:
#Create database connection
connection_string = "postgres:postgres@localhost:5432/nba_db"
engine = create_engine(f'postgresql://{connection_string}')

In [11]:
# Confirm tables
engine.table_names()

['mvp', 'players', 'salaries']

In [16]:
new_mvp_df.to_sql(name='mvp', con=engine, if_exists='append', index=False)

In [17]:
new_players_df.to_sql(name='players', con=engine, if_exists='append', index=False)

In [18]:
new_salaries_df.to_sql(name='salaries', con=engine, if_exists='append', index=False)